<?php

return [
    'page_title' => 'Корзина - ',
    'title' => 'Корзина покупок',
    'table' => [
        'product' => 'Товар',
        'price' => 'Цена',
        'quantity' => 'Количество',
        'total' => 'Итого',
        'remove' => 'Удалить',
    ],
    'button' => [
        'remove' => 'Удалить',
        'loading' => 'Загрузка...',
    ],
    'empty' => 'Ваша корзина пустая!',
    'summary' => [
        'title' => 'Всего',
        'subtotal' => 'Промежуточный итог',
        'taxes' => 'Налоги',
        'shipping' => 'Доставка',
        'total' => 'Итого',
        'button' => 'Оформить заказ',
    ],
    'alert' => [
        'title' => 'Удаление товара',
        'text' => 'Вы уверены, что хотите удалить <b>:product</b> из корзины?',
    ],
];
