<?php

return [
    'page_title' => 'Главная страница - ',
    'hero' => [
        'content' => [
            'title' => 'Начните своё путешествие с ',
            'subtitle' => 'Покупайте разнообразную электронику: смартфоны, ноутбуки, смарт-часы, телевизоры и многое другое.',
        ],

        'buttons' => [
            'get_started' => 'Начать',
            'contact_sales' => 'Связаться с отделом продаж',
        ],

        'reviews' => [
            'first' => [
                'rating' => '4.6',
                'summary' => 'из 12 тыс. отзывов',
            ],
            'second' => [
                'rating' => '4.8',
                'summary' => 'из 5 тыс. отзывов',
            ],
        ],
    ],
    'brands_section' => [
        'title_html' => 'Оцените Популярные <span class="text-blue-500">Бренды</span>',
        'subtitle' => 'Ознакомьтесь с нашими лучшими брендами, предлагающими качественную электронику для любых потребностей.',
    ],
    'categories_section' => [
        'title_html' => 'Посмотрите <span class="text-blue-500">Категории</span>',
        'subtitle' => 'Изучите широкий выбор категорий, чтобы найти именно то, что вам нужно.',
    ],
    'custom_reviews_section' => [
        'title_html' => 'Отзывы <span class="text-blue-500">Клиентов</span>',
        'subtitle' => 'Читайте, что говорят наши клиенты о продуктах и услугах.',
        'joined_text' => 'С нами с',
        'rating' => 'Оценка:',
        'reply' => 'Ответить',
    ],


];
