<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Table Columns
    |--------------------------------------------------------------------------
    */

    'column.name' => 'Название',
    'column.guard_name' => 'Тип защиты',
    'column.team' => 'Команда',
    'column.roles' => 'Роли',
    'column.permissions' => 'Разрешения',
    'column.updated_at' => 'Обновлено',

    /*
    |--------------------------------------------------------------------------
    | Form Fields
    |--------------------------------------------------------------------------
    */

    'field.name' => 'Название',
    'field.guard_name' => 'Тип защиты',
    'field.permissions' => 'Разрешения',
    'field.team' => 'Команда',
    'field.team.placeholder' => 'Выберите команду ...',
    'field.select_all.name' => 'Выбрать всё',
    'field.select_all.message' => 'Включает/отключает все разрешения для этой роли',

    /*
    |--------------------------------------------------------------------------
    | Navigation & Resource
    |--------------------------------------------------------------------------
    */

    'nav.group' => 'Права доступа',
    'nav.role.label' => 'Роли',
    'nav.role.icon' => 'heroicon-o-shield-check',
    'resource.label.role' => 'роль',
    'resource.label.roles' => 'Роли',

    /*
    |--------------------------------------------------------------------------
    | Section & Tabs
    |--------------------------------------------------------------------------
    */

    'section' => 'Сущности',
    'resources' => 'Ресурсы',
    'widgets' => 'Виджеты',
    'pages' => 'Страницы',
    'custom' => 'Пользовательские разрешения',

    /*
    |--------------------------------------------------------------------------
    | Messages
    |--------------------------------------------------------------------------
    */

    'forbidden' => 'У вас нет прав для доступа',

    /*
    |--------------------------------------------------------------------------
    | Resource Permissions' Labels
    |--------------------------------------------------------------------------
    */

    'resource_permission_prefixes_labels' => [
        'view' => 'Просмотр',
        'view_any' => 'Просмотр всех',
        'create' => 'Создание',
        'update' => 'Обновление',
        'update_self' => 'Редактирование своего профиля',
        'delete' => 'Удаление',
        'delete_any' => 'Удаление всех',
        'force_delete' => 'Принудительное удаление',
        'force_delete_any' => 'Принудительное удаление всех',
        'restore' => 'Восстановление',
        'reorder' => 'Изменение порядка',
        'restore_any' => 'Восстановление всех',
        'replicate' => 'Клонирование',
    ],
];
